#ifndef _DRI_TABLE_GEN_H
#define _DRI_TABLE_GEN_H

#define DEBUG_MODE			0 //TBC
#define HSY_TEST_MODE		1
//#define ENABLE_HSY          1
#define HSY_MODE    (((GLOBL_HSL_IP_SEL == GLOBL_HSL_IP_HSY) || (INDEP_HSL_IP_SEL == INDEP_HSL_IP_HSY)) ? 1 : 0)
#define WRITE_HSY_TABLE_BY_ADL	(1 && CHIP_ID==MST9U5 || (CHIP_ID == CHIP_MT9701))	// 1: write HSY tables by autodownloiad    //0:write HSY tables by RIU

//#define MT9701_LOAD_TABLE	1
#define TABLE_GEN_BY_HW	(1 && CHIP_ID==CHIP_MT9701)	// 1: HW     0:FW

#if (CHIP_ID == MST9U5)
#define ROTATION_LIMIT		1	// 1: Enable (MT9701)	0: Disable (MT9700)
#else
/*FW compensation*/
#define ROTATION_LIMIT		(0 && TABLE_GEN_BY_HW)
#endif
#define FCC_MODE_EN		(1 && TABLE_GEN_BY_HW)	// FCC SKIN/MOBA mode. 1:enable   0:diable 

#define INPUT_LIMITATION	1

#define MT9701_V_MODE		(1 && CHIP_ID==MST9U5) 

#if MT9701_V_MODE
#define MT9701_V_MODE_ADD_dY		1

#define RATIO_NUMERATOR			8			/* ratio: 0.5 ~ 1.5, so  RATIO_NUMERATOR = ratio << (RATIO_DENIMINATOR_BIT).
												 Ex: if RATIO_DENIMINATOR_BIT = 3, ratio = 1, then RATIO_NUMERATOR = 1 << 3 = 8 */
#define RATIO_DENIMINATOR_BIT		3
#endif

#define REG_HSL_UVNORM_MAX	512
#define REG_HSL_UVNORM_SCALE	1024 	// when REG_HSL_UVNORM_SCALE = 1024, REG_HSL_UVNORM_MAX = 512
										// when REG_HSL_UVNORM_SCALE = 724, REG_HSL_UVNORM_MAX = 724

// math library
#define min( a , b )     ( (a) < (b) ? (a) : (b) )
#define max( a , b )     ( (a) > (b) ? (a) : (b) )

#define REG_FAVOR_MOBA_REGION_LUMA_L_5 	0x0			// Luma lower bound: 0~0xFFF
#define REG_FAVOR_MOBA_REGION_LUMA_U_5 	0xFFF		// Luma upper bound: 0~0xFFF
#define REG_FAVOR_MOBA_HUE_GAIN_5		0xFF		// Hue gain: 0 ~ 0xFF
#define REG_FAVOR_MOBA_SAT_GAIN_5		0xFF		// Sat gain: 0 ~ 0xFF
#define REG_FAVOR_MOBA_LUMA_GAIN_5		0xFF		// Luma gain: 0 ~ 0xFF

// Outside	
#define REG_FCC_MOBA_YIN_SEL 				0 		// 0:Yin    1:Lin
#define REG_DH_FAVOR_MOBA_OUTSIDE			0		// S10: dH for favor color capture outside
#define REG_DS_FAVOR_MOBA_OUTSIDE			0x00       // 1.7: 128=1x, dS for favor color capture outside//0:Sat = 0
#define REG_DY_FAVOR_MOBA_OUTSIDE			0		// S10: dY for favor color capture outside
#define REG_HSL_FCC_MOBA_OUTSIDE_Y_SEL		0            // 0: Outside FCC dY=reg_dY_favor_outside, 1: Outside FCC to Lin when reg_fcc_yin_sel=0


typedef enum
{
	FCC_SKIN_MODE,
	FCC_MOBA_MODE
} HSL_FCC_MODE_SEL;

#endif

typedef enum
{
    GEN_BY_HW,
    GEN_BY_FW
} HSL_COMPEN_GEN_SEL;

//typedef unsigned short WORD;
//typedef unsigned char  BYTE;

/*
// for different color space compensation points, refer MATLAB: ColorSpace_Ref.m
#if 0
// 709
const int HueTable[24] = { 1756, 2025, 2363, 2705, 2983, 3234, 3494, 3729, 3920, 4110, 4338, 4588, 4828, 5096, 5433, 5776, 6054, 162, 423, 657, 848, 1037, 1265, 1515 };
const int SatTable[24] = { 525, 450, 420, 444, 514, 489, 499, 541, 609, 546, 507, 500, 525, 451, 421, 444, 514, 489, 499, 541, 609, 546, 507, 500 };
const int LumaTable[24] = { 217, 401, 584, 767, 949, 895, 841, 786, 732, 750, 769, 787, 806, 623, 440, 257, 74, 128, 183, 237, 291, 273, 254, 236 };
#else
// 601, maxRGB is 1024, assume U+ is 0 degree
const int HueTable[24] = {1854, 2090, 2373, 2663, 2914, 3164, 3448, 3723, 3953, 4179, 4437, 4698, 4926, 5161, 5444, 5734, 5986, 93, 378, 652, 881, 1106, 1364, 1625};
const int SatTable[24] = {540, 479, 453, 467, 518, 471, 459, 486, 546, 496, 477, 493, 540, 479, 453, 467, 518, 470, 459, 486, 546, 496, 477, 492};
const int LumaTable[24] = {306, 456, 606, 757, 906, 830, 754, 677, 601, 630, 659, 688, 717, 567, 417, 267, 117, 193, 270, 346, 422, 393, 364, 335};
#endif

#ifdef MT9701_LOAD_TABLE
const int Sat_global_Table1[9]	= {0x20, 0x40, 0x60, 0x80, 0xA0, 0xC0, 0xE0, 0x100, 0x120};
const int Sat_global_max_Table1[9] = {0x20, 0x40, 0x60, 0x80, 0xA0, 0xC0, 0xE0, 0x100, 0x120};
const int Sat_global_min_Table1[9] =  {0x20, 0x40, 0x60, 0x80, 0xA0, 0xC0, 0xE0, 0x100, 0x120};
const int Global_Hue_by_Hue_Table1[14] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
const int Global_Luma_by_Hue_Table1[14] ={0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
const int Global_Sat_by_Hue_Table1[14] = {0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80};
const int	Global_Sat_by_Luma_Table1[9] = {0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80, 0x80};
const int	Global_Luma_by_MaxRGB_Table1[9] = {0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40, 0x40};
const int	Luma_gray_Table[9] = {0, 0, 0, 0, 0, 0, 0, 0, 0};
*/

int gdH_UI[6], gdS_UI[6], gdY_UI[6];


#if WRITE_HSY_TABLE_BY_ADL
typedef struct _HSY_TABLE_ADL_FORMAT
{
#if 1
	MS_U8 hueByhue;			//  8 bit  [7:0]   	Depth: 36
	MS_U8 hueBysat_L;			// 8 bit   [7:0]  	Depth: 36*9
	MS_U8 hueBysat_H;			// 1 bit   [8]  		Depth: 36*9
	MS_U8 hueByluma_L;			// 8 bit   [7:0]      	Depth: 36*9
	MS_U8 hueByluma_H;			// 1 bit   [8]      	Depth: 36*9
	MS_U8 satByhue_global_L;	// 8 bit   [7:0]      	Depth: 36*9	
	MS_U8 satByhue_global_H;	// 1 bit   [8]      	Depth: 36*9	
	MS_U8 satByhue_max_L;		// 8 bit   [7:0]      	Depth: 36*9	
	MS_U8 satByhue_max_H;		// 1 bit   [8]      	Depth: 36*9	
	MS_U8 satByhue_min_L;		// 8 bit   [7:0]      	Depth: 36*9	
	MS_U8 satByhue_min_H;		// 1 bit   [8]      	Depth: 36*9	
	MS_U8 satByluma; 			// 8 bit   [7:0]      	Depth: 36*9
	MS_U8 lumaBysat_L; 			// 8 bit   [7:0]      	Depth: 36*9
	MS_U8 lumaBysat_H; 			// 1 bit   [8]      	Depth: 36*9
	MS_U8 lumaByluma_L;		// 8 bit   [8]      	Depth: 36*9
	MS_U8 lumaByluma_H;             // 2 bit  [1:0]    	Depth: 36*9
#else
	MS_U8 hueByhue;			//  8 bit  [7:0]   	Depth: 36
	MS_U16 hueBysat;				// 9 bit   [16:8]  	Depth: 36*9
	MS_U16 hueByluma;			// 9 bit   [32:24]      Depth: 36*9
	MS_U16 satByhue_global; 		// 9 bit   [48:40]      Depth: 36*9
	MS_U16 satByhue_max; 		// 9 bit   [64:56]      Depth: 36*9
	MS_U16 satByhue_min; 		// 9 bit   [80:72]      Depth: 36*9
	MS_U8 satByluma; 			// 8 bit   [95:88]      Depth: 36*9
	MS_U16 lumaBysat;			// 9 bit   [104:96]     Depth: 36*9
	MS_U16 lumaByluma;                // 10 bit  [121:112]    Depth: 36*9
#endif
	//MS_U8 dummy[16]; //dummy space for 256 bit mode
}S_HSY_TABLE_ADL_FORMAT;

extern S_HSY_TABLE_ADL_FORMAT hsy_table_adl[DEPTH_ADL_HSY_TABLE];
#endif

#if (CHIP_ID == MST9U5) //MT9701_LOAD_TABLE
typedef struct _HSL_REG_
{
    int dbg_dump_dbg_en;
    int dbg_target_h;
    int dbg_target_v;
    int reg_hsl_input_mode;
    int reg_hsl_output_mode;
    int reg_ycbcr_limit_range;
    int reg_y2r_11;
    int reg_y2r_21;
    int reg_y2r_23;
    int reg_y2r_33;
    int reg_hsl_RGB2YUV_dither_en;
    int reg_en_adv_pdn;
    int reg_hsl_rgb_mode;

    int reg_hsl_hue_en;
    int reg_hsl_hue_degree_initial;
    int reg_hsl_hue_by_sat_en;
    int reg_hsl_hue_by_lig_en;
    int reg_hsl_global_hue_delta_theta;

    int reg_hsl_sat_en;
    int reg_hsl_sat_pre_max_limit;
    int reg_hsl_sat_post_max_limit;
    int reg_hsl_global_sat_gain;
    int reg_hsl_global_sat_curve_en;

    int reg_hsl_lig_en;
    int reg_hsl_global_lig_offset;
    int reg_hsl_global_lig_gain;

    int reg_hsl_lig_gp_min_strength;
    int reg_hsl_lig_gp_thrd;
    int reg_hsl_lig_gp_slope;
    int reg_hsl_hue_gp_en;
    int reg_hsl_sat_gp_en;
    int reg_hsl_lig_gp_en;

    //-------add new design--------------
    int reg_hsl_sat_by_lig_en;
    int reg_hsl_sat_by_hue_en;
    int reg_hsl_lig_by_lig_en;
    int reg_hsl_lig_by_sat_en;
    int reg_hsl_hue_by_hue_en;
    int reg_hsl_hue_dither_en;
    int reg_hsl_sat_dither_en;
    int reg_hsl_luma_dither_en;
    int reg_hsl_SY2RGB_dither_en;
    int reg_hsl_H2RGB_dither_en;
    int reg_hsl_sat_increase_mode;
    int reg_hsl_sat_decrease_mode;
    int reg_hsl_sat_global_increase_mode;
    int reg_hsl_sat_global_decrease_mode;
    int reg_hsl_lig_global_gain_mode;
    int reg_hsl_delta_rgb_mode;
    int reg_hsl_hue_mode;
    int reg_hsl_uvangle_scale_0 ;
    int reg_hsl_uvangle_offset_0;
    int reg_hsl_uvangle_scale_1 ;
    int reg_hsl_uvangle_offset_1;
    int reg_hsl_uvangle_scale_2 ;
    int reg_hsl_uvangle_offset_2;
    int reg_hsl_sat_mode;
    int reg_hsl_uvnorm_scale;

    int reg_hsl_rgb_min;
    int reg_hsl_rgb_max;
    int reg_hsl_delta_y_zero_sel_en;

    int reg_hsl_sat_for_hue_process_sel;
    int reg_hsl_sat_for_sat_process_sel;
    int reg_hsl_sat_for_luma_process_sel;
    int reg_hsl_luma_for_hue_process_sel;
    int reg_hsl_luma_for_sat_process_sel;
    int reg_hsl_luma_for_luma_process_sel;
    int reg_hsl_mode;
    int reg_hsl_global_sat_by_luma_mode;
    int reg_hsl_global_sat_by_hue_en;
    int reg_hsl_global_sat_by_luma_en;
    int reg_hsl_global_hue_by_hue_en;
    int reg_hsl_global_luma_by_hue_en;
    int reg_hsl_global_luma_mode;

    int reg_hsl_global_contrast;
    int reg_hsl_global_brightness;

    int reg_hsl_hue_gray;
    int reg_hsl_sat_gray;
    int reg_hsl_luma_global_gain_min;

    int reg_hsl_debug_mode_en;
    int reg_hsl_input_for_debug_sel;
    int reg_hsl_debug_hue_start;
    int reg_hsl_debug_hue_end;
    int reg_hsl_debug_sat_start;
    int reg_hsl_debug_sat_end;
    int reg_hsl_debug_luma_start;
    int reg_hsl_debug_luma_end;
    int reg_hsl_debug_gray_sel;

    int reg_en_debug_pix;
    int reg_debug_pix_sel;

    int reg_hsl_mwe_enable;
    int reg_hsl_window_v_start;
    int reg_hsl_window_v_end;
    int reg_hsl_window_h_start;
    int reg_hsl_window_h_end;

    int reg_hsl_hue_rotate_alpha;
    int reg_uvrotate_t1;
    int reg_uvrotate_t2;
    int reg_uvrotate_t3;
    int reg_uvrotate_t4;
    int reg_uvrotate_t5;
    int reg_uvrotate_t6;
    //-----------------------------------

    int reg_hsl_hue_delta_amp; //2 bit
    int reg_hsl_sat_gain_by_delta_y_limit; //4 bit
    int reg_hsl_hue_lpf_en; //1 bit
    int reg_hsl_sat_lpf_en; //1 bit
    int reg_hsl_lig_lpf_en; //1 bit
    int reg_hsl_hue_lpf_min_strength; //6 bit
    int reg_hsl_sat_lpf_min_strength; //6 bit
    int reg_hsl_lig_lpf_min_strength; //6 bit
    int reg_hsl_hue_lpf_thrd; //10 bit
    int reg_hsl_sat_lpf_thrd; //10 bit
    int reg_hsl_lig_lpf_thrd; //10 bit
    int reg_hsl_hue_lpf_slope; //6 bit
    int reg_hsl_sat_lpf_slope; //6 bit
    int reg_hsl_lig_lpf_slope; //6 bit
    
    int reg_r2y_12; // 13, T0.10
    int reg_r2y_13; // 13, T0.10
    int reg_r2y_21; // 13, T0.10
    int reg_r2y_22; // 13, T0.10
    int reg_r2y_23; // 13, T0.10
    int reg_r2y_31; // 13, T0.10
    int reg_r2y_32; // 13, T0.10

    int reg_hsl_path_bypass;

// For auto download 
    int reg_adl_trig_wdth;
    int reg_en_adl;
    int reg_hsl_path_sel;
    int reg_sram_lut_rd_sel;
    int reg_adl_err_flag;
    int reg_adl_adr_sel;
}stHSL_REG;

#elif (CHIP_ID==CHIP_MT9701)
typedef struct _HSL_REG_
{
    int reg_y2r_11;
    int reg_y2r_21;
     int reg_y2r_23;
    int reg_y2r_33;
    int reg_fcc_yin_sel;
    int reg_pattern_r;
    int reg_pattern_g;
    int reg_pattern_b;
    int reg_pattern_gen_en;
    int YUV_full_random;

    int reg_hsl_hue_en;
    int reg_hsl_hue_degree_initial;
    int reg_hsl_global_hue_delta_theta;

    int reg_hsl_sat_en;
    int reg_hsl_sat_pre_max_limit;
    int reg_hsl_sat_post_max_limit;
    int reg_hsl_global_sat_en;
    int reg_hsl_sat_by_lig_en;
    int reg_hsl_lig_en;


    int reg_sat_global_blending_en;

    int reg_hsl_lig_gp_min_strength;
    int reg_hsl_lig_gp_thrd;
    int reg_hsl_lig_gp_slope;
    int reg_hsl_hue_gp_en;
    int reg_hsl_sat_gp_en;
    int reg_hsl_lig_gp_en;
    int reg_hsl_sy2rgb_dither_en;

    //-------add new design--------------
    int reg_hsl_lig_by_lig_en;
    int reg_hsl_hue_dither_en;
    int reg_hsl_sat_dither_en;
    int reg_hsl_luma_dither_en;
    int reg_hsl_uvangle_scale_0 ;
    int reg_hsl_uvangle_offset_0;
    int reg_hsl_uvangle_scale_1 ;
    int reg_hsl_uvangle_offset_1;
    int reg_hsl_uvangle_scale_2 ;
    int reg_hsl_uvangle_offset_2;
    int reg_hsl_uvnorm_scale;

    int reg_hsl_rgb_min;
    int reg_hsl_rgb_max;

    int reg_hsl_global_hue_by_hue_en;
    int reg_hsl_global_luma_by_hue_en;


    int reg_hsl_hue_gray;
    int reg_hsl_sat_gray;

    int reg_hsl_debug_hue_start;
    int reg_hsl_debug_hue_end;
    int reg_hsl_debug_sat_start;
    int reg_hsl_debug_sat_end;
    int reg_hsl_debug_luma_start;
    int reg_hsl_debug_luma_end;


    //-----------------------------------

    int reg_hsl_hue_delta_amp; // 2 bit

    int reg_r2y_12; // 13, T0.10
    int reg_r2y_13; // 13, T0.10
    int reg_r2y_21; // 13, T0.10
    int reg_r2y_22; // 13, T0.10
    int reg_r2y_23; // 13, T0.10
    int reg_r2y_31; // 13, T0.10
    int reg_r2y_32; // 13, T0.10

// --------- For HW ---------------
    int reg_hsl_path_bypass;


// -------------------------------
    int reg_favor_region;

    int reg_favor_region_1;
    int reg_favor_region_hueu_1;
    int reg_favor_region_huel_1;
    int reg_favor_region_satu_1;
    int reg_favor_region_satl_1;
    int reg_favor_region_lumau_1;
    int reg_favor_region_lumal_1;
    int reg_dh_favor_adjust_1;
    int reg_ds_favor_adjust_1;
    int reg_dy_favor_adjust_1;
    int reg_favor_hue_gain_1;
    int reg_favor_sat_gain_1;
    int reg_favor_luma_gain_1;

    int reg_favor_region_2;
    int reg_favor_region_hueu_2;
    int reg_favor_region_huel_2;
    int reg_favor_region_satu_2;
    int reg_favor_region_satl_2;
    int reg_favor_region_lumau_2;
    int reg_favor_region_lumal_2;
    int reg_dh_favor_adjust_2;
    int reg_ds_favor_adjust_2;
    int reg_dy_favor_adjust_2;
    int reg_favor_hue_gain_2;
    int reg_favor_sat_gain_2;
    int reg_favor_luma_gain_2;


